app/Controllers/AdminProduct.php

SELECT *
FROM `main_category`
ORDER BY `name` ASC
---
    public function product()
    {
        $maincategory = new MainCategoryModel();
        $data = $maincategory->orderBy('name', 'ASC')->findAll();

INSERT INTO `product` (`category`, `sub_category`, `detail`, `name`, `quantity`, `price`, `image`) VALUES ('Shelley Hickman', 'Julian Burks', 'Qui ea voluptatem N', 'Irma Flynn', '660', '409', 'p6.jpg')
---
    public function addproduct()
    {
        $product = new ProductModel();
        $file = $this->request->getFile('image');
        if ($file->isValid() && !$file->hasMoved()) {
            $imageName = $file->getName();
            $file->move('public/uploads/', $imageName);
        }
        $data = [
            'category' => $this->request->getPost('maincat'),
            'sub_category' => $this->request->getPost('subcat'),
            'detail' => $this->request->getPost('detail'),
            'name' => $this->request->getPost('name'),
            'quantity' => $this->request->getPost('quantity'),
            'price' => $this->request->getPost('price'),
            'image' => $imageName,
        ];
        $product->save($data);