app/Controllers/AdminProduct.php

SELECT *
FROM `main_category`
SELECT *
FROM `sub_category`
SELECT *
FROM `product`
WHERE `product`.`id` = '7'
---
    public function edit($id = null){
        echo $id;
        $maincategory = new MainCategoryModel();
        $product = new ProductModel();
        $subcategory = new SubCategoryModel();

        $data = $maincategory->findAll();
        $data2 = $subcategory->findAll();
        $data3 = $product->find($id);