app/Controllers/AdminProduct.php

    public function inventory()
    {
        $product = new ProductModel();
        $data = $product->findAll();
---
SELECT *
FROM `product`