app/Controllers/Cart.php

    public function cart()
    {
        $newsession = new CartModel();
        $order = new OrdersModel();

        $fetch = $newsession->where('user_id', session('userid'))->where('order_status', 0)->first();

        $order->select('*');
        $order->join('product', 'product.id = orders.product_id');
        $data = $order->where('cart_id', $fetch['id'])->get()->getResultArray();
---
SELECT *
FROM `cart`
WHERE `user_id` = '18'
AND `order_status` = 0
 LIMIT 1
SELECT *
FROM `orders`
JOIN `product` ON `product`.`id` = `orders`.`product_id`
WHERE `cart_id` = '97cc07b29fa81c7e3d1805888a2499d9'