app/Controllers/Login.php

INSERT INTO `user` (`user_name`, `user_password`, `user_email`, `customer_name`) VALUES ('root', '56d3b50459e6156f51fe17e8caf2c921', 'jhonw214@gmail.com', 'dsg')
---
    public function userSignup()
    {
        $name = $this->request->getVar("name");
        $username = $this->request->getVar("username");
        $email = $this->request->getVar("email");
        $password = $this->request->getVar("password");

        $values = [
            'user_name' => $username,
            'user_password' => md5($password),
            'user_email' => $email,
            'customer_name' => $name,
        ];

        $userModel = new \App\Models\UserModel();
        $query = $userModel->insert($values);